app/controllers/api/v1/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."updated_at" DESC
---
    def index
      articles = Article.published.order(updated_at: :desc)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 109], ["LIMIT", 1]]
---
    def show
      article = Article.published.find(params[:id])

INSERT INTO "users" ("uid", "encrypted_password", "name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "articles" ("title", "body", "user_id", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "ｄｓふぁ"], ["body", "ｓｄふぁｆｄさｆｓだ"], ["user_id", 1], ["created_at", "2024-02-19 12:13:09.425431"], ["updated_at", "2024-02-19 12:13:09.425431"], ["status", "published"]]
---
    def create
      # 送信されたパラメータを params で取得する
      # そのパラメータとログインユーザーに紐づいた記事を作る
      # articlesは関連するレコードを取得するために記述
      article = current_user.articles.create!(article_params)

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1 AND "articles"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "body" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["body", "## テスト\n\n___\n\n- テストテスト\n  - テストてすと\n\n1. テスト\n2. テスト\n\n`be rails s`\n\nｆｄさｆｄさｆｄさｊはｓ；ｄｆｋｈｄさ\n\n"], ["updated_at", "2024-02-19 12:13:38.109691"], ["id", 1]]
---
    def update
      article = current_user.articles.find(params[:id])
      article.update!(article_params)

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1 AND "articles"."id" = $2 LIMIT $3  [["user_id", 12], ["id", 8], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 8]]
---
    def destroy
      article = current_user.articles.find(params[:id])
      article.destroy!