app/controllers/api/v1/base_api_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def current_user
    @current_user = User.first